Repository: vitamin-caig/zxtune
Catalog: l10n/*/io.po
Languages: ru

source: Failed to resolve uri '%1%'.
ru: Ошибка анализа идентификатора '%1%'.

source: Specified uri scheme is not supported.
ru: Данная схема идентификатора не поддерживается.

source: Not supported in current configuration
ru: Не поддерживается в текущей конфигурации.

source: Failed to read %1% bytes. Actually got %2% bytes.
ru: Ошибка чтения %1% байт. Прочитано %2%.

source: File is empty.
ru: Файл пуст.

source: Failed to open file.
ru: Ошибка открытия файла.

source: Failed to write file '%1%'
ru: Ошибка записи файла '%1%'.

source: Failed to flush file '%1%'
ru: Ошибка синхронизации файла '%1%'.

source: Failed to seek file '%1%'
ru: Ошибка позиционирования файла '%1%'.

source: File already exists.
ru: Файл существует.

source: Local files and file:// scheme support
ru: Поддержка доступа к локальным файлам и схемы file://

source: Failed to open file '%1%'.
ru: Ошибка открытия файла '%1%'.

source: Failed to create file '%1%'.
ru: Ошибка создания файла '%1%'.

source: Network error happends: %1%
ru: Сетевая ошибка: %1%

source: Http error happends: %1%.
ru: Ошибка HTTP: %1%.

source: Network files access via different schemes support
ru: Поддержка доступа к сетевым файлам

source: Failed to open network resource '%1%'.
ru: Ошибка открытия сетевого ресурса '%1%'.

source: Not supported.
ru: Не поддерживается.
